examples/performance/java-lambda-optimization/measurements/final/uc1-lmi-run3-20260318-083328.txt

Summary:
  Total:	19.0243 secs
  Slowest:	0.6570 secs
  Fastest:	0.0834 secs
  Average:	0.1389 secs
  Requests/sec:	104.8658
  
  Total data:	223459 bytes
  Size/request:	112 bytes

Response time histogram:
  0.083 [1]	|
  0.141 [1171]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.198 [739]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.256 [42]	|■
  0.313 [0]	|
  0.370 [24]	|■
  0.428 [0]	|
  0.485 [9]	|
  0.542 [4]	|
  0.600 [0]	|
  0.657 [5]	|


Latency distribution:
  10%% in 0.0968 secs
  25%% in 0.1013 secs
  50%% in 0.1150 secs
  75%% in 0.1754 secs
  90%% in 0.1803 secs
  95%% in 0.1926 secs
  99%% in 0.3537 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0016 secs, 0.0000 secs, 0.3328 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0137 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0077 secs
  resp wait:	0.1357 secs, 0.0833 secs, 0.5280 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	1995 responses