examples/performance/java-lambda-optimization/measurements/final/uc1-native-run2-20260318-083328.txt

Summary:
  Total:	22.2719 secs
  Slowest:	1.7999 secs
  Fastest:	0.0968 secs
  Average:	0.1612 secs
  Requests/sec:	89.5749
  
  Total data:	223474 bytes
  Size/request:	112 bytes

Response time histogram:
  0.097 [1]	|
  0.267 [1887]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.437 [56]	|■
  0.608 [29]	|■
  0.778 [1]	|
  0.948 [13]	|
  1.119 [1]	|
  1.289 [0]	|
  1.459 [6]	|
  1.630 [0]	|
  1.800 [1]	|


Latency distribution:
  10%% in 0.1077 secs
  25%% in 0.1129 secs
  50%% in 0.1269 secs
  75%% in 0.1751 secs
  90%% in 0.2002 secs
  95%% in 0.2951 secs
  99%% in 0.8798 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0774 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0069 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:	0.1605 secs, 0.0968 secs, 1.7998 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0162 secs

Status code distribution:
  [200]	1995 responses