examples/performance/java-lambda-optimization/measurements/final/uc1-native-run3-20260318-083328.txt

Summary:
  Total:	20.0486 secs
  Slowest:	0.5458 secs
  Fastest:	0.0979 secs
  Average:	0.1468 secs
  Requests/sec:	99.5081
  
  Total data:	223454 bytes
  Size/request:	112 bytes

Response time histogram:
  0.098 [1]	|
  0.143 [1139]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.188 [609]	|■■■■■■■■■■■■■■■■■■■■■
  0.232 [167]	|■■■■■■
  0.277 [26]	|■
  0.322 [17]	|■
  0.367 [23]	|■
  0.411 [11]	|
  0.456 [1]	|
  0.501 [0]	|
  0.546 [1]	|


Latency distribution:
  10%% in 0.1078 secs
  25%% in 0.1127 secs
  50%% in 0.1258 secs
  75%% in 0.1755 secs
  90%% in 0.1902 secs
  95%% in 0.2095 secs
  99%% in 0.3501 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0009 secs, 0.0000 secs, 0.1189 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0435 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.1458 secs, 0.0979 secs, 0.5457 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0368 secs

Status code distribution:
  [200]	1995 responses