examples/performance/java-lambda-optimization/measurements/final/uc1-snapstart-run1-20260318-083328.txt

Summary:
  Total:	27.6356 secs
  Slowest:	5.7597 secs
  Fastest:	0.0941 secs
  Average:	0.1817 secs
  Requests/sec:	72.1895
  
  Total data:	223682 bytes
  Size/request:	112 bytes

Response time histogram:
  0.094 [1]	|
  0.661 [1989]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.227 [0]	|
  1.794 [0]	|
  2.360 [0]	|
  2.927 [0]	|
  3.493 [0]	|
  4.060 [0]	|
  4.627 [0]	|
  5.193 [4]	|
  5.760 [1]	|


Latency distribution:
  10%% in 0.1104 secs
  25%% in 0.1219 secs
  50%% in 0.1666 secs
  75%% in 0.1900 secs
  90%% in 0.2455 secs
  95%% in 0.3116 secs
  99%% in 0.3631 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0000 secs, 0.0775 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0050 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.1812 secs, 0.0941 secs, 5.6885 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	1995 responses