examples/performance/java-lambda-optimization/measurements/final/uc1-snapstart-run2-20260318-083328.txt

Summary:
  Total:	19.9922 secs
  Slowest:	0.4862 secs
  Fastest:	0.0929 secs
  Average:	0.1485 secs
  Requests/sec:	99.7888
  
  Total data:	223519 bytes
  Size/request:	112 bytes

Response time histogram:
  0.093 [1]	|
  0.132 [951]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.172 [364]	|■■■■■■■■■■■■■■■
  0.211 [563]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.250 [46]	|■■
  0.290 [14]	|■
  0.329 [40]	|■■
  0.368 [13]	|■
  0.408 [0]	|
  0.447 [1]	|
  0.486 [2]	|


Latency distribution:
  10%% in 0.1034 secs
  25%% in 0.1106 secs
  50%% in 0.1361 secs
  75%% in 0.1761 secs
  90%% in 0.1890 secs
  95%% in 0.2193 secs
  99%% in 0.3262 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0000 secs, 0.0764 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0050 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.1480 secs, 0.0928 secs, 0.4862 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [200]	1995 responses