examples/performance/java-lambda-optimization/measurements/final/uc1-snapstart-run3-20260318-083328.txt

Summary:
  Total:	20.2223 secs
  Slowest:	0.4932 secs
  Fastest:	0.0891 secs
  Average:	0.1477 secs
  Requests/sec:	98.6536
  
  Total data:	223504 bytes
  Size/request:	112 bytes

Response time histogram:
  0.089 [1]	|
  0.130 [929]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.170 [354]	|■■■■■■■■■■■■■■■
  0.210 [609]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.251 [44]	|■■
  0.291 [13]	|■
  0.332 [32]	|■
  0.372 [12]	|■
  0.412 [0]	|
  0.453 [0]	|
  0.493 [1]	|


Latency distribution:
  10%% in 0.1028 secs
  25%% in 0.1102 secs
  50%% in 0.1365 secs
  75%% in 0.1763 secs
  90%% in 0.1915 secs
  95%% in 0.2124 secs
  99%% in 0.3149 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0796 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0060 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:	0.1471 secs, 0.0891 secs, 0.4931 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	1995 responses