examples/performance/java-lambda-optimization/measurements/final/uc1-standard-run2-20260318-083328.txt

Summary:
  Total:	34.8326 secs
  Slowest:	4.7236 secs
  Fastest:	0.0944 secs
  Average:	0.2335 secs
  Requests/sec:	57.2739
  
  Total data:	223558 bytes
  Size/request:	112 bytes

Response time histogram:
  0.094 [1]	|
  0.557 [1928]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.020 [20]	|
  1.483 [15]	|
  1.946 [3]	|
  2.409 [16]	|
  2.872 [1]	|
  3.335 [0]	|
  3.798 [0]	|
  4.261 [3]	|
  4.724 [8]	|


Latency distribution:
  10%% in 0.1143 secs
  25%% in 0.1273 secs
  50%% in 0.1671 secs
  75%% in 0.2006 secs
  90%% in 0.2718 secs
  95%% in 0.5126 secs
  99%% in 2.2823 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0014 secs, 0.0000 secs, 0.1940 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0547 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0029 secs
  resp wait:	0.2320 secs, 0.0943 secs, 4.7236 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0025 secs

Status code distribution:
  [200]	1995 responses