examples/performance/java-lambda-optimization/measurements/final/uc1-standard-run3-20260318-083328.txt

Summary:
  Total:	25.6926 secs
  Slowest:	2.4920 secs
  Fastest:	0.0966 secs
  Average:	0.1843 secs
  Requests/sec:	77.6488
  
  Total data:	223543 bytes
  Size/request:	112 bytes

Response time histogram:
  0.097 [1]	|
  0.336 [1914]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.576 [52]	|■
  0.815 [8]	|
  1.055 [3]	|
  1.294 [5]	|
  1.534 [4]	|
  1.773 [1]	|
  2.013 [0]	|
  2.252 [4]	|
  2.492 [3]	|


Latency distribution:
  10%% in 0.1087 secs
  25%% in 0.1187 secs
  50%% in 0.1641 secs
  75%% in 0.1898 secs
  90%% in 0.2439 secs
  95%% in 0.3125 secs
  99%% in 0.8917 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0011 secs, 0.0000 secs, 0.2136 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0136 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:	0.1822 secs, 0.0965 secs, 2.4920 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	1995 responses