examples/performance/java-lambda-optimization/measurements/final/uc2-lmi-run1-20260318-083328.txt

Summary:
  Total:	46.1587 secs
  Slowest:	4.0763 secs
  Fastest:	0.1232 secs
  Average:	0.2891 secs
  Requests/sec:	43.2204
  
  Total data:	1137233 bytes
  Size/request:	570 bytes

Response time histogram:
  0.123 [1]	|
  0.519 [1694]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.914 [259]	|■■■■■■
  1.309 [10]	|
  1.704 [21]	|
  2.100 [5]	|
  2.495 [0]	|
  2.890 [1]	|
  3.286 [3]	|
  3.681 [0]	|
  4.076 [1]	|


Latency distribution:
  10%% in 0.1447 secs
  25%% in 0.1624 secs
  50%% in 0.1972 secs
  75%% in 0.2484 secs
  90%% in 0.6163 secs
  95%% in 0.7065 secs
  99%% in 1.5320 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0023 secs, 0.0000 secs, 0.5065 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0145 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0015 secs
  resp wait:	0.2857 secs, 0.1231 secs, 4.0740 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0040 secs

Status code distribution:
  [200]	1994 responses
  [500]	1 responses