examples/performance/java-lambda-optimization/measurements/final/uc2-lmi-run2-20260318-083328.txt

Summary:
  Total:	39.8518 secs
  Slowest:	1.9658 secs
  Fastest:	0.1210 secs
  Average:	0.2690 secs
  Requests/sec:	50.0605
  
  Total data:	1137209 bytes
  Size/request:	570 bytes

Response time histogram:
  0.121 [1]	|
  0.305 [1589]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.490 [137]	|■■■
  0.674 [135]	|■■■
  0.859 [100]	|■■■
  1.043 [3]	|
  1.228 [7]	|
  1.412 [13]	|
  1.597 [7]	|
  1.781 [1]	|
  1.966 [2]	|


Latency distribution:
  10%% in 0.1457 secs
  25%% in 0.1603 secs
  50%% in 0.1953 secs
  75%% in 0.2374 secs
  90%% in 0.5873 secs
  95%% in 0.7034 secs
  99%% in 1.3383 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0010 secs, 0.0000 secs, 0.1371 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0563 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.2678 secs, 0.1209 secs, 1.9655 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	1994 responses
  [500]	1 responses