examples/performance/java-lambda-optimization/measurements/final/uc2-lmi-run3-20260318-083328.txt

Summary:
  Total:	38.0654 secs
  Slowest:	3.9230 secs
  Fastest:	0.0641 secs
  Average:	0.2628 secs
  Requests/sec:	52.4098
  
  Total data:	1136531 bytes
  Size/request:	569 bytes

Response time histogram:
  0.064 [1]	|
  0.450 [1723]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.836 [230]	|■■■■■
  1.222 [13]	|
  1.608 [15]	|
  1.994 [10]	|
  2.379 [0]	|
  2.765 [1]	|
  3.151 [1]	|
  3.537 [0]	|
  3.923 [1]	|


Latency distribution:
  10%% in 0.1402 secs
  25%% in 0.1517 secs
  50%% in 0.1864 secs
  75%% in 0.2195 secs
  90%% in 0.5748 secs
  95%% in 0.6977 secs
  99%% in 1.4955 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0030 secs, 0.0000 secs, 0.4219 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0123 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0024 secs
  resp wait:	0.2596 secs, 0.0640 secs, 3.9229 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [200]	1993 responses
  [500]	2 responses